<template>
  <div>
    <h1 class="midashi">学校設備<span>School Facilities</span></h1>
    <section>
      <h2>3号館</h2>
      <p>
        3号館は、2011~13年の改修工事で新築された、1号館と2号館を繋いでいる校舎です(西館と1号館の1階のPC教室、2階の校長室、3階の第2社会科教室・理科講義室を含めて3号館と呼ぶこともあります)。
      </p>
      <p>
        2階には職員室があり、職員室棟とも呼ばれています。1階には放送室・会議室・面談室、3階には化学教室、4階には物理教室・多目的教室があります。
      </p>
      <p>
        2階の職員室前の通路には机と椅子があり、先生と生徒が対話するためのスペースとなっています。また、4階の多目的室は主に新高生の授業で使われます。
      </p>
    </section>
    <section>
      <h2>ゴミ捨て場</h2>
      <p>
        灘校の西門を入ってすぐの、研修館の正面と右隣にゴミ捨て場があります。教室にあるごみ箱が一杯になったら掃除当番や日直、級長がごみを捨てに行くところです。研修館の右隣が燃えるゴミ、正面がペットボトルを捨てる場所となっています。
      </p>
      <p>
        阪神電車を使って登校している人は毎日見ることになりますが、阪急電車やJRで登校する人は見る機会が少ないので、中学2年生になってもゴミ捨て場の場所が分からない、という人が一定数います。
      </p>
      <p>
        通常ごみ袋から中身が漏れているなどということはなく、カラスがごみを漁りに来たり、異臭がしたりすることはありません。
      </p>
    </section>
    <section>
      <h2>プール</h2>
      <p>
        灘校のプールは中学等の南東、高校等の北東に位置しています。6つのレーンを持つ25mのプールで最深部は1.36mとなっています。主に水泳部の活動場所として使われていますが、夏には一般生徒も体育の授業の一環として使用しています。
      </p>
      <p>
        授業では水温と気温の合計が50°C以上、部活動等では45°C以上の時に使用することが可能で、例年は5月から9月末まで利用可能です。温水シャワーも完備されており、寒い日でも快適に泳ぐことが可能です。
      </p>
    </section>
    <section>
      <h2>研修館</h2>
      <p>
        研修館は校舎の西側に位置し、西門を入って右手に見える建物です。魚崎駅から登校する人はよく目にすることになると思います。
      </p>
      <p>
        1階には卓球場とワンダーフォーゲル部の部室があります。卓球場は主に卓球部の活動場所として使用されますが、体育の授業で使われることもあります。
      </p>
      <p>
        2階は畳敷きの大きな部屋やシャワー室などがあり、クラブ合宿の宿泊場所としてしばしば使用されるほか、古典文化同好会やレゴ同好会、社会科学研究同好会の活動場所にもなっています。
      </p>
      <p>
        3階には緑の畳の大広間があり、少林寺拳法同好会の活動場所となっています。
      </p>
    </section>
    <section>
      <h2></h2>
      <p></p>
    </section>
  </div>
</template>
<script>
export default {}
</script>
<style lang="scss" scoped>
.midashi {
  font-weight: 500;
  text-align: center;
  margin-top: 2em;
  margin-bottom: 1.5em;
  font-size: 1.7em;
  span {
    display: block;
    font-size: 0.5em;
    font-weight: 200;
  }
}
section {
  margin: 0 5%;
  margin-bottom: 2em;
  h2 {
    font-size: 1.5em;
    margin-bottom: 0.8em;
  }
  p {
    line-height: 1.5;
    margin-bottom: 0.5em;
    text-align: justify;
  }
}
</style>