<template>
  <div>
    <h1 class="midashi">年間行事<span>Year Actions</span></h1>
    <section>
      <h2>4月 April</h2>
      <h3>入学式</h3>
      <p>新入生の方々、ご入学おめでとうございます。</p>
      <h3>始業式</h3>
      <h3>新入生オリエンテーション・クラブ説明会(新高生・中1)</h3>
      <p>
        始業式の日には、新入生オリエンテーションとクラブ説明会が行われます。
      </p>
      <p>
        新入生オリエンテーションでは、中学委員会によって校内施設等の案内が行われます。実際に部活動をしている様子も見ることができるかもしれません。
      </p>
      <p>
        クラブ説明会では、約40にも及ぶクラブによる活動紹介が行われます。是非入りたいクラブを見つけてください。
      </p>
      <p>
        新入生オリエンテーションとクラブ説明会を通して、灘校のことを少しでもわかってもらえれば幸いです。
      </p>
      <h3>宿題考査(中1以外)</h3>
      <p>
        春休みの課題が定着しているかどうかの確認テストです。基本的に、国数英の3教科の試験が行われます。
      </p>
      <p>
        灘校の定期考査には、宿題考査、中間考査、期末考査の3つがあります。基本的に、宿題考査は1日、中間考査は3日、期末考査は6日あります。3学期は中間考査がありません。また、各考査の前後や間には「生徒臨休」と呼ばれる休校日が設けられることがあります。有効活用しましょう。
      </p>
      <h3>オリエンテーション(中1)</h3>
      <p>
        1学期の宿題考査の日に中1はオリエンテーションを行います。オリエンテーションでは灘校周辺を散策します。入学後初の校外活動ですので、友達との親睦を深める良い機会にしてください。
      </p>
    </section>
    <section>
      <h2>5月 May</h2>
      <h3>文化祭</h3>
      <p>
        灘校の一大イベントである文化祭は、例年は5月2日・3日に開催されますが、昨年は情勢を鑑みて6月に開催されました。各部活のブースをはじめとして中庭ステージでの筋肉王やMr.&Ms.コンテスト、視聴覚室や大講堂ステージでの様々なパフォーマンスなど多くの見どころがあります。
      </p>
      <p>
        高学年の皆さんのみならず、新入生の皆さんも委員会や各部活など積極的に運営側に回ってみてください。より文化祭を楽しむことができると思います。
      </p>
      <h3>健康診断</h3>
      <p>
        身長、体重の測定、視力や聴力の検査などを行います。生徒に配られるICカードは各検査で必要となるので、絶対に無くさないようにしましょう。
      </p>
      <h3>中間考査</h3>
      <p>
        5月の中旬には中間考査があります。5月は文化祭などもあり、忙しい月になるでしょうが、新学年で最初の中間考査となるので気を引き締めて頑張りましょう。
      </p>
    </section>
    <section>
      <h2>6月 June</h2>
      <h3>甲南定期戦</h3>
      <p>
        毎年6月に、灘校と甲南高等学校・中学校のそれぞれの運動部で親善試合が行われます。これを甲南定期戦と呼びます。昭和28年に始まった伝統ある行事です。
      </p>
      <p>
        会場は1年おきに交互で、今年は甲南高等学校・中学校になる予定です。応援団も結成されるので、興味がある人は参加してみてはいかがでしょうか。
      </p>
      <p>
        例年は、試合に出場しない生徒も応援として登校することになっていますが、新型コロナウイルスの影響で2020年度は中止、2021年度は試合に出場する人のみの参加となりました。
      </p>
      <h3>生徒会中央委員選挙</h3>
      <p>
        生徒会長や文化委員長などの中央委員を決める選挙です。選挙日が近づいてくると、各立候補者が教室を回り、自身の公約などを生徒に伝えます。非常に重要なイベントなので、しっかり考えてから投票しましょう。
      </p>
    </section>
    <section>
      <h2>7月 July</h2>
      <h3>期末考査</h3>
      <p>すぐ後に夏休みが待っています。頑張りましょう。</p>
      <h3>スポーツ大会</h3>
      <p>
        期末考査が終了し、少し休みを挟んだ後のテスト返却日の前日に行われます。近年、出場者が少ない傾向があるので、気軽に参加しましょう!
      </p>
      <h3>夏休み</h3>
      <p>
        灘校の夏休みは、7月の中旬から9月の上旬までの1ヶ月以上あります。宿題は計画的に済ましてさえいれば、それほど多く感じないでしょう。各クラブの合宿はこの期間にあることが多いです。ただ、宿題考査を忘れないように!
      </p>
    </section>
    <section>
      <h2>8月 August</h2>
      <h3>英国異文化研修(高1希望者)</h3>
      <p>
        高校1年生の希望者約40名が参加します。イギリスにあるウィンチェスター校もしくはラドリー校に滞在し、現地の学生や他国から来た学生との交流を通じて、異文化に触れることが目的です。
      </p>
    </section>
    <section>
      <h2>9月 September</h2>
      <h3>宿題考査</h3>
      <p>夏休みの課題が定着しているかどうかの確認テストです。</p>
      <h3>体育祭</h3>
      <p>
        灘校の文化祭は毎年9月下旬に行われます。全体リハーサルは一度しかなく、進行のちぐはぐさは良くも悪くも灘校名物です。中学生が行う400mリレーの理事長杯、高校生が行う1000mリレーの校長杯や相撲などが人気です。また競技だけでなく、複数のチームが描いた垂れ幕にも注目です。2020年度や2021年度は、新型コロナウイルスの影響で規模を縮小して開催されましたが、今までと同様の盛り上がりを見せました。
      </p>
    </section>
    <section>
      <h2>10月 October</h2>
      <h3>中間考査</h3>
      <h3>創立記念日</h3>
      <p>
        10月24日は創立記念日です。今年度で95周年になります。この日は学校が休みになり、前日に紅白饅頭が配られ、校長先生からのお話があります。
      </p>
    </section>
    <section>
      <h2>11月 November</h2>
      <h3>学年別遠足</h3>
      <p>
        遠足は11月の上旬に学年ごとに行われます。近畿圏の様々な場所を観光し、現地集合・現地解散が灘校の伝統となっています。
      </p>
      <h3>中学学芸祭</h3>
      <p>
        中学生全員が参加し、様々な芸術作品を作り上げます。以前は合唱コンクールというものが伝統として行われていましたが、新型コロナウイルスの感染拡大のため開催が出来ず、2020年度はモザイクアート、2021年度はピタゴラスイッチが各クラスで作られました。また任意参加の個人作品も飾られます。生徒主体で開催されるので、皆さんの力でより良い学芸祭を作っていきましょう!
      </p>
      <h3>高校学芸祭(演劇コンクール)</h3>
      <p>
        高校1年生と2年生が参加し、クラスごとに大講堂で演劇を披露します。演劇や美術に関する様々な賞があり、各クラスが賞の獲得を目指して練習します。脚本やセット、音響にいたるまですべて生徒の手で作り上げます。運営は文化委員会が行います。
      </p>
    </section>
    <section>
      <h2>12月 December</h2>
      <h3>期末考査</h3>
      <p>長い2学期もこれで最後です。頑張って乗り越えましょう。</p>
      <h3>スポーツ大会</h3>
      <h3>冬休み</h3>
      <p>
        灘校の長期休暇は他の学校よりも早く始まるので、その分多くのことができます。2学期の疲れを癒やし、3学期に備えましょう。
      </p>
      <h3>スキー講習会(中学生希望者)</h3>
      <p>
        冬休みに入るとすぐ、4泊5日の日程で長野県の志賀高原にてスキー講習会が行われます。事前に自分のスキーの実力によって分かれ、現地でインストラクターの方々に指導を受けることになっています。雄大な自然の中で思う存分滑ることが出来るため、初心者も熟練者も楽しむことができます。
      </p>
      <p>
        毎年大人気のイベントで、300人の定員を超えて抽選になることもありますが、たとえ抽選に外れたとしても、次の年には必ず参加できる仕組みになっています。往復のバスや宿舎での生活の中でもクラスメイトとの距離を縮めることの出来る、中学校生活最大のイベントの1つです。
      </p>
      <p>
        2020,2021年度は新型コロナウイルス感染拡大の影響を受けて、中止となりました。
      </p>
    </section>
    <section>
      <h2>1月 January</h2>
      <h3>宿題考査</h3>
      <p>冬休みの課題が定着しているかどうかの確認テストです。</p>
      <h3>中学入試</h3>
      <p>
        中学入試期間中、在校生は自宅学習期間となり、自宅学習用の課題が出されることもあります。コロナが流行する前は、中3から入試補助員が募集されていましたが、現在はコロナの影響で募集されていません。
      </p>
    </section>
    <section>
      <h2>2月 February</h2>
      <h3>高校卒業式</h3>
      <p>
        原則、高校生のみ出席可能ですが中学生も会場である体育館の2階席から観覧することができます。毎年、卒業証書授与の際、部や生徒会の活動でお世話になった先輩の名前を叫ぶ人もいるそうです。
      </p>
      <h3>高校入試</h3>
      <p>
        高校入試期間中も、中学入試期間中と同様に、在校生は自宅学習期間となります。
      </p>
      <h3>駅伝大会</h3>
      <p>
        各部活動が「清流」とよばれる住吉川河川敷を走ってタイムを競う大会です。1チーム5人で1周4.7キロメートルの遊歩道を3周します。また区間賞があり、その5名は後日氏名が張り出されます。ぜひ区間賞宣言をして区間賞を狙ってみてください。
      </p>
    </section>
    <section>
      <h2>3月 March</h2>
      <h3>期末考査</h3>
      <h3>スポーツ大会</h3>
      <h3>中学卒業式</h3>
      <p>
        中学卒業式は、終業式と同じ日に高校入学式を兼ねて大講堂で行われます。中学3年生は終業式に出なくて大丈夫です。
      </p>
      <h3>春休み</h3>
      <p>宿題が出ます。次の学年に向けて頑張りましょう。</p>
    </section>
  </div>
</template>
<script setup lang="ts">
useHead({
  title: '年間行事',
})
</script>
<style lang="scss" scoped>
.midashi {
  font-weight: 500;
  text-align: center;
  margin-top: 2em;
  margin-bottom: 1.5em;
  font-size: 1.7em;
  span {
    display: block;
    font-size: 0.5em;
    font-weight: 200;
  }
}
section {
  margin: 0 5%;
  line-height: 1.7;
  margin-bottom: 2em;
  h2 {
    margin-bottom: 1em;
    border-bottom: 1px solid #000;
    border-left: 1px solid #000;
    background: #f4f4f4;
    padding-left: 0.5em;
  }
  h3 {
    margin-top: 1em;
    margin-bottom: 0.5em;
  }
  p {
    margin-bottom: 0.2em;
    text-align: justify;
  }
}
@media screen and (min-width: 960px) {
  section {
    margin: 0 20%;
    margin-bottom: 2em;
  }
}
</style>
