<template>
  <div>
    <h1 class="midashi">学校設備<span>School Facilities</span></h1>
    <section>
      <h2>3号館</h2>
      <img src="@/assets/img/facilities/building3.jpg" alt="3号館" />
      <p>
        3号館は、2011~13年の改修工事で新築された、1号館と2号館を繋いでいる校舎です(西館と1号館の1階のPC教室、2階の校長室、3階の第2社会科教室・理科講義室を含めて3号館と呼ぶこともあります)。
      </p>
      <p>
        2階には職員室があり、職員室棟とも呼ばれています。1階には放送室・会議室・面談室、3階には化学教室、4階には物理教室・多目的教室があります。
      </p>
      <p>
        2階の職員室前の通路には机と椅子があり、先生と生徒が対話するためのスペースとなっています。また、4階の多目的室は主に新高生の授業で使われます。
      </p>
    </section>
        <section>
      <h2>プール</h2>
      <img src="@/assets/img/facilities/pool.jpg" alt="プール" />
      <p>
        灘校のプールは中学等の南東、高校等の北東に位置しています。6つのレーンを持つ25mのプールで最深部は1.36mとなっています。主に水泳部の活動場所として使われていますが、夏には一般生徒も体育の授業の一環として使用しています。
      </p>
      <p>
        授業では水温と気温の合計が50°C以上、部活動等では45°C以上の時に使用することが可能で、例年は5月から9月末まで利用可能です。温水シャワーも完備されており、寒い日でも快適に泳ぐことが可能です。
      </p>
    </section>
    <section>
      <h2>研修館</h2>
      <img src="@/assets/img/facilities/training_center.jpg" alt="研修館" />
      <p>
        研修館は校舎の西側に位置し、西門を入って右手に見える建物です。魚崎駅から登校する人はよく目にすることになると思います。
      </p>
      <p>
        1階には卓球場とワンダーフォーゲル部の部室があります。卓球場は主に卓球部の活動場所として使用されますが、体育の授業で使われることもあります。
      </p>
      <p>
        2階は畳敷きの大きな部屋やシャワー室などがあり、クラブ合宿の宿泊場所としてしばしば使用されるほか、古典文化同好会やレゴ同好会、社会科学研究同好会の活動場所にもなっています。
      </p>
      <p>
        3階には緑の畳の大広間があり、少林寺拳法同好会の活動場所となっています。
      </p>
    </section>
    <section>
      <h2>硬式テニスコート</h2>
      <img
        src="@/assets/img/facilities/tennis_court.jpg"
        alt="硬式テニスコート"
      />
      <p>
        硬式テニスコートは、体育館と国道２号線との間に位置しています（第二グラウンドに隣接する、軟式テニスコートとは異なります）。テニスコートは３面あり、硬式テニス部の活動場所となっています。2011～13年の校舎改修の際に人工芝となりました。
      </p>
      <p>
        また、バスケットボール部、バドミントン部、バレーボール部の部室に行く場合はここを横切る必要があります。
      </p>
    </section>
    <section>
      <h2>高校棟</h2>
      <img src="@/assets/img/facilities/building2.jpg" alt="２号館" />
      <p>
        高校棟（２号館）は、2002年に新設された建物です。正式名称は２号館ですが、高校生の教室が入っていることから高校棟と呼ばれています。新中庭からこの建物を見たとき、高校棟の１階の左に音楽室、右にトレーニングルームがあります。
      </p>
      <p>
        音楽室では音楽の授業、そしてグリー部やクラシック研究部などの部活動が行われています。また、トレーニングルームは、中３以上の生徒が顧問の許可を得たうえで使用することができます。そして、２階に高３、３階に高２、４階に高１の教室があります。
      </p>
    </section>
    <section>
      <h2>食堂</h2>
      <img src="@/assets/img/facilities/cafeteria.jpg" alt="食堂" />
      <p>
        食堂は正門を入って左側の、東館の地下１階にあります。株式会社クールさんが運営してくださっており、日替わりのメニューが沢山あります。牛丼やきつねうどん、カツカレーなど豊富なメニューを楽しむことができます。
      </p>
      <p>
        中でもサイドメニューの一つである灘チキは、人気でおすすめです。今は、麺類を除く全てのメニューがテイクアウトできるようになっています。
      </p>
    </section>
    <section>
      <h2>西館</h2>
      <img src="@/assets/img/facilities/west_building.jpg" alt="西館" />
      <p>
        西館は、1997年に竣工した後に建て替えられ、3号館と一体化した現在の姿になりました。1階には柔道場があり、灘校創立にご尽力された嘉納治五郎先生直筆の「精力善用」と「自他共栄」があります。また、2階には大講義室、3階には生物教室と剣道場があります。
      </p>
    </section>
    <section>
      <h2>体育館</h2>
      <img src="@/assets/img/facilities/gymnasium.jpg" alt="体育館" />
      <p>
        正門を出てすぐ右に見える建物が体育館です。入学試験の合格発表をはじめ、始業式や高校卒業式、合唱コンクールなどの様々な行事や体育の授業で使用されています。普段の部活では入って右から、バスケットボール部、バレー部、バドミントン部が練習をしています。
      </p>
      <p>
        また、体育館の地下にはパイプ椅子の倉庫やブラスバンド部の練習場所があります。体育館は土足禁止ですので、授業には体育館シューズを持参します。
      </p>
    </section>
    <section>
      <h2>新中庭・スクエア</h2>
      <img
        src="@/assets/img/facilities/new_courtyard_and_square.jpg"
        alt="新中庭・スクエア"
      />
      <p>
        新中庭・スクエアとは中学棟と高校棟の間にある庭のことです。この庭は扇形の大きな階段を挟んで１階部分と２階部分に分かれていて、１階部分を新中庭、２階部分をスクエアと言います。ここには、紅葉の美しいカイノキなど、たくさんの樹木が植えられています。秋にはとても綺麗な紅葉を見ることができます。
      </p>
    </section>
    <section>
      <h2>東館</h2>
      <img src="@/assets/img/facilities/east_biulding.jpg" alt="東館" />
      <p>
        東館は、正門を通ると左手に見える建物で、１号館と繋がっています。地下１階に食堂、１階に大会議室と技術教室と美術教室、２階に視聴覚教室、ICT教室があります。特に、視聴覚教室は、映像を使った授業や、外部からの講師を招いて行う講義、説明会などで、頻繁に利用されます。
      </p>
      <p>
        また屋上には、天体観測室があります。
      </p>
    </section>
    <section>
      <h2>中学棟</h2>
      <img src="@/assets/img/facilities/Building1.jpg" alt="中学棟" />
      <p>
        今の中学棟は、1938年の火災で焼失した昔の校舎の代わりに作られました。当時としては最高級の鉄筋コンクリートが使われていたため、阪神・淡路大震災でも倒壊することなく、現在もその姿を残しています。この棟の正式名称は１号館ですが、中学校の教室が棟内に入っているため、「中学棟」と呼ばれています。
      </p>
      <p>
        １階には、図書館の一部とブックラウンジ、保健室、文化部長屋、PC教室、同好会室が、２階には、中学１年生の教室と第１社会科教室、セミナー室、生徒会室、書道教室があります。
      </p>
      <p>
        また、３階には、中学２年生の教室と第１、２英語教室、４階には、中学３年生の教室と地学教室、テラスがあります。そして、２階から４階の西側にフリースペースがあります。教室には昔から使われている机椅子があるなど、昔ながらの雰囲気を残しているところもあります。
      </p>
    </section>
    <section>
      <h2>中庭</h2>
      <img src="@/assets/img/facilities/courtyard.jpg" alt="中庭" />
      <p>
        中庭は、本館と中学棟、東館に囲まれて立地しています。校内で唯一天然芝が施されています。（ほとんど芝生が生えていないところもありますが…）校内では１番、野村ドームをきれいに拝むことができる非常にありがたい場所にもなっています。
      </p>
      <p>
        休み時間や放課後に、中学１年生優先で遊ぶことができ、体育祭の応援団の練習などにも使われています。さらに、毎年行われている文化祭では、「中庭ステージ」がここで開催されています。
      </p>
    </section>
    <section>
      <h2>第１グラウンド</h2>
      <img src="@/assets/img/facilities/1st_ground.jpg" alt="第１グラウンド" />
      <p>
        高校棟南側にある大きなグラウンドが第１グラウンドです。中学や高校のグラウンドとしては珍しい人工芝の自慢のグラウンドです。普段は体育の授業で使われ、放課後には野球部やソフトボール同好会が活動しています。そのため、ブルペンやマウンド等の野球用設備も整っています。
      </p>
      <p>
        また、年に一度の体育祭もここで行われます。人工芝の劣化を防止するために、水・お茶以外の飲食物の持ち込みは禁止されています。
      </p>
    </section>
    <section>
      <h2>第２グラウンド</h2>
      <img src="@/assets/img/facilities/2nd_ground.jpg" alt="第２グラウンド" />
      <p>
        学校の最も東に位置する第２グラウンドは、サッカーコート１面分の広さがあります。第１グラウンド同様に全面が人工芝で、トイレもあります。体育の授業では、サッカーのときに利用し、放課後には陸上競技部、サッカー部、ラグビー部が練習しています。また、軟式テニスコートにもつながっています。
      </p>
      <p>
        校舎とは、歩道橋でつながっていて、夕方ごろには灘校生御用達のラーメン屋、しぇからしかの匂いがします。
      </p>
    </section>
    <section>
      <h2>図書館</h2>
      <img src="@/assets/img/facilities/library.jpg" alt="図書館" />
      <p>
        灘校の図書館は中学棟と高校棟の間にあります。全国の中学・高校でも有数の蔵書数を誇り、灘校の近くの東灘図書館よりも充実しているのではないかと言われるほどです。吹き抜けで開放的となっており、自然光のもとで読書や勉強に没頭することができます。また、本の貸し借りだけではなく自習や読書ができるよう、机や椅子が多く設置されており、寝転がるためのソファーや、冬場に出されるこたつなど、一風変わった家具もあります。
      </p>
      <p>
        読みたい本を予約できる上に、図書館にない本はリクエストして取り寄せてもらうことができます。他にも、新聞や雑誌、漫画など様々なものがあり、とても充実した図書館となっています。
      </p>
      <p>
        また、週に１回、図書館から発行される本の新着案内「NANDA KANDA」では、生徒や先生のリクエストした新着本などが司書さんの言葉で紹介されており、読書の幅を広げるきっかけとなるでしょう。
      </p>
      <p>
        魅力にあふれた図書館は、皆さんの灘校生活をさらに豊かにしてくれる場所となるでしょう。ぜひ図書館を上手に活用して、充実した灘校生活を送ってください！
      </p>
    </section>
    <section>
      <h2>本館</h2>
      <img src="@/assets/img/facilities/main_building.jpg" alt="本館" />
      <p>
        正門を入って正面に見える建物が本館です。灘校のシンボルとも言えます。阪神・淡路大震災の被害を免れ、1928年開校当時のままの建物です。2001年には文化庁によって国の登録有形文化財に指定されました。
      </p>
      <p>
        １階には事務所などがあります。事務所では願書や入試問題などを買うことができます。１階の中央通路は西館側と３号館側に繋がっていますが、事務所に用がない限り通ってはいけないことになっています。
      </p>
      <p>
        また、２階には大講堂があります。例年であれば、入学式や高校学芸祭、文化祭のステージなどに使われます。また、美術の作品制作などもここで行う時があります。行書で書かれた「精力善用」「自他共栄」の額が掛けられています。これは、柔道場にあるものとは別の字体となっています。
      </p>
    </section>
  </div>
</template>
<script>
export default {}
</script>
<style lang="scss" scoped>
.midashi {
  font-weight: 500;
  text-align: center;
  margin-top: 2em;
  margin-bottom: 1.5em;
  font-size: 1.7em;
  span {
    display: block;
    font-size: 0.5em;
    font-weight: 200;
  }
}
section {
  margin: 0 5%;
  margin-bottom: 2em;
  h2 {
    font-size: 1.5em;
    margin-bottom: 0.8em;
  }
  img {
    display: block;
    margin: 2em 0;
    width: 100%;
  }
  p {
    line-height: 1.5;
    margin-bottom: 0.5em;
    text-align: justify;
  }
}
@media screen and (min-width: 960px) {
  section {
    margin: 0 20%;
    margin-bottom: 2em;
    img {
      width: 20em;
    }
  }
}
</style>
